app/views/home/index.html.erb

						<tbody>
							<% Product.order(:created_at).first(10).each do |row|%>
---
SELECT  `products`.* FROM `products` ORDER BY `products`.`created_at` ASC LIMIT 10
SELECT MAX(`products`.`created_at`) AS maximum_created_at, category_id, created_at AS category_id_created_at FROM `products` GROUP BY category_id, created_at ORDER BY `products`.`created_at` ASC

										<td><a href="ProductProfile?product=<%=row['id']%>"><%= row['name'] %></a></td>
										<td><%= Category.find(row['category_id']).name %></td>
										<td><a href="seller_profile?user=<%=row['user_id']%>"><%= User.find(row['user_id']).name %></a></td>
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1