app/views/user_view/admin_panel.html.erb

                <tbody>
                    <% User.find_each do |row|%>
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1000

                <tbody>
                    <% Product.find_each do |row|%>
---
SELECT  `products`.* FROM `products` ORDER BY `products`.`id` ASC LIMIT 1000

                                <td><a href="ProductProfile?product=<%=row['id']%>"><%= row['name'] %></a></td>
                                <td><%= User.find(row['user_id']).name %></td>
                                <td><%= Category.find(row['category_id']).name %></td>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1