app/views/user_view/create_product.html.erb

                                <select style="width: 100%" id="SO1">
                                    <% ShippingOption.find_each do |row|%>
---
SELECT  `shipping_options`.* FROM `shipping_options` ORDER BY `shipping_options`.`id` ASC LIMIT 1000

                            <select style="width: 100%" id="cat_id">
                                <% Category.find_each do |row|%>
---
SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC LIMIT 1000