app/views/user_view/main_page.html.erb

                    <tbody>
                        <% Product.find_each do |row|%>
---
SELECT  `products`.* FROM `products` ORDER BY `products`.`id` ASC LIMIT 1000

                                    <td><a href="ProductProfile?product=<%=row['id']%>"><%= row['name'] %></a></td>
                                    <td><%= Category.find(row['category_id']).name %></td>
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1

                            <div class="col-md-2">
                                    <a href="seller_profile?user=<%=row['origin_user']%>"><%= User.find(row['origin_user']).name %></a>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1