app/views/user_view/others_page.html.erb

SELECT  `products`.* FROM `products` ORDER BY `products`.`id` ASC LIMIT 1000
---
                        <tbody>
                            <% Product.find_each do |row|%>

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
---
                                        <td><a href="ProductProfile?product=<%=row['id']%>"><%= row['name'] %></a></td>
                                        <td><%= Category.find(row['category_id']).name %></td>