app/views/user_view/product_profile.html.erb

                                <select style="width: 100%" id="SO1">
                                    <% ProductShipping.find_each do |row|%>
                                        <% if row['product_id'] == @productId.to_i%>
                                            <option value="<%= raw row['id']%>"><%= ShippingOption.find(row['shipping_id']).name%></option>
---
SELECT  `product_shippings`.* FROM `product_shippings` ORDER BY `product_shippings`.`id` ASC LIMIT 1000
SELECT  `shipping_options`.* FROM `shipping_options` WHERE `shipping_options`.`id` = 2 LIMIT 1

                <div class="sub_home">
                    <% if Product.find(@productId).user_id != current_user.id%>
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 ORDER BY `users`.`id` ASC LIMIT 1