app/views/user_view/search_view.html.erb

                <div class="trend-ads">
                        <h2>Category: <%= Category.find(@category_id).name %></h2>
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1

                            <option value="0">General</option>
                            <% Category.find_each do |row|%>
---
SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC LIMIT 1000

                    <%if  @category_id != nil%>
                        <% Product.where("category_id = ?", @category_id).each do |row|%>
                            <%if row['block'] != true and User.find(row['user_id']).status != 1%>
---
SELECT `products`.* FROM `products` WHERE (category_id = '2')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 ORDER BY `users`.`id` ASC LIMIT 1

                    <%else%>
                        <% Product.find_each do |row|%>
---
SELECT  `products`.* FROM `products` ORDER BY `products`.`id` ASC LIMIT 1000