app/controllers/user_view_controller.rb

  def main_page
    total = 0
    SellCalification.where("target_user = ?", current_user.id).each do |row|
      puts "entré"
      total = row['rating'].to_i + total
    end
    number = SellCalification.where("target_user = ?", current_user.id).count
---
SELECT `buy_califications`.* FROM `buy_califications` WHERE (target_user = 4)
SELECT `sell_califications`.* FROM `sell_califications` WHERE (target_user = 4 AND flag is null)
SELECT COUNT(*) FROM `buy_califications` WHERE (target_user = 4)
SELECT COUNT(*) FROM `sell_califications` WHERE (target_user = 4 AND flag is null)

  def rate_buyers
    User.connection.execute("Update sell_califications SET flag = 1 where id = "+params['id'].to_s+";")
    BuyCalification.create!({:target_user => params['user'],:origin_user => current_user.id, :rating => params['grade']})
---
INSERT INTO `buy_califications` (`target_user`, `origin_user`, `rating`, `created_at`, `updated_at`) VALUES (5, 4, 3, '2017-10-05 10:51:09', '2017-10-05 10:51:09')

  def newProduct
    p = Product.create!({:name=>params[:name],:description=>params[:description], :category_id=>params[:category_id], :user_id=>current_user.id})
    if params[:so_1].to_i != 1
      ProductShipping.create!({:product_id=>p.id,:shipping_id=>params[:so_1]})
---
INSERT INTO `products` (`user_id`, `name`, `description`, `category_id`, `created_at`, `updated_at`) VALUES (1, 'A', 'B', 1, '2017-10-04 13:30:46', '2017-10-04 13:30:46')
INSERT INTO `product_shippings` (`product_id`, `shipping_id`, `created_at`, `updated_at`) VALUES (1, 2, '2017-10-04 13:30:46', '2017-10-04 13:30:46')

  def others_page
    @userId = params['user']
    @username = User.find(@userId).name
    @userdesc = User.find(@userId).description

    total = 0
    SellCalification.where("target_user = ?", @userId).each do |row|
      total = row['rating'].to_i + total
    end
    number = SellCalification.where("target_user = ?", @userId).count
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `buy_califications`.* FROM `buy_califications` WHERE (target_user = 5)
SELECT `sell_califications`.* FROM `sell_califications` WHERE (target_user = '4')
SELECT COUNT(*) FROM `buy_califications` WHERE (target_user = 5)
SELECT COUNT(*) FROM `sell_califications` WHERE (target_user = '4')

  def product_profile
    @productId = params['product']
    @productname = Product.find(@productId).name
    @productdesc = Product.find(@productId).description
    @productcat = Category.find(Product.find(@productId).category_id).name
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1

  def buy_product
    SellCalification.create!({:target_user => Product.find(params['productId']).user_id,:origin_user => current_user.id, :rating => params['grade']})
---
INSERT INTO `sell_califications` (`target_user`, `origin_user`, `rating`, `created_at`, `updated_at`) VALUES (4, 5, 4, '2017-10-04 17:18:37', '2017-10-04 17:18:37')
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1